In [1]:
import pandas as pd
import numpy as np

In [3]:
pop = pd.Series([33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561], index=['a','b','c','d','e','f'])
pop

a    33871648
b    37253956
c    18976457
d    19378102
e    20851820
f    25145561
dtype: int64

In [4]:
index=['a','b','c','d','e','f']
pop = pd.Series([33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561], index=index)
pop

a    33871648
b    37253956
c    18976457
d    19378102
e    20851820
f    25145561
dtype: int64

In [6]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [7]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [18]:
l = []
for i in pop.index:
    if i[1] == 2010:
        l.append(pop[i])
print(l)

[37253956, 19378102, 25145561]

In [22]:
l = [[pop[i] for i in pop.index if i[1] == 2010]]
l

[[37253956, 19378102, 25145561]]

In [23]:
pop[[('California', 2010),('New York', 2010),('Texas', 2010)]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [8]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [24]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [25]:
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [26]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [27]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [28]:
pop_df = pop.unstack() # DataFrame
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [29]:
pop_sir = pop_df.stack() # Series
pop_sir

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [30]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [31]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [33]:
pop_df['under18'], pop_df['total']

(California  2000    9267089
             2010    9284094
 New York    2000    4687374
             2010    4318033
 Texas       2000    5906301
             2010    6879014
 Name: under18, dtype: int64,
 California  2000    33871648
             2010    37253956
 New York    2000    18976457
             2010    19378102
 Texas       2000    20851820
             2010    25145561
 Name: total, dtype: int64)

In [34]:
pop_df['under18'] / pop_df['total']

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

In [35]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [37]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'b', 'c', 'd']],
                  columns=['data1', 'data2'])
df

      data1     data2
a  0.372098  0.085591
b  0.084675  0.286240
c  0.901390  0.172750
d  0.349397  0.756599

In [38]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.952205  0.615174
  2  0.302616  0.640841
b 1  0.029379  0.412722
  2  0.365404  0.554133

In [39]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [45]:
# 계층적 인덱스와 열
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# 일부 데이터 모형 만들기
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# DataFrame 생성하기
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      24.0  36.9  41.0  37.7  45.0  36.8
     2      39.0  35.8  35.0  38.8  38.0  36.2
2014 1      40.0  37.2  28.0  38.1  37.0  37.6
     2      40.0  35.4  44.0  36.7  48.0  38.0

In [49]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      41.0  37.7
     2      35.0  38.8
2014 1      28.0  38.1
     2      44.0  36.7

In [52]:
health_data['Guido', 'HR']

year  visit
2013  1        41.0
      2        35.0
2014  1        28.0
      2        44.0
Name: (Guido, HR), dtype: float64

In [53]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [55]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [54]:
pop['California', 2000]

33871648

In [56]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [57]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [61]:
# 모든 데이터에서 22000000보다 큰 데이터만 출력하시오.
pop > 22000000 # 마스크

state       year
California  2000     True
            2010     True
New York    2000    False
            2010    False
Texas       2000    False
            2010     True
dtype: bool

In [62]:
pop[pop > 22000000] # 마스킹

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [63]:
# California, Texas 데이터를 가지고 오시오. Fancy Indexing
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [64]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      24.0  36.9  41.0  37.7  45.0  36.8
     2      39.0  35.8  35.0  38.8  38.0  36.2
2014 1      40.0  37.2  28.0  38.1  37.0  37.6
     2      40.0  35.4  44.0  36.7  48.0  38.0

In [65]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      24.0  36.9
     2      39.0  35.8

In [67]:
health_data.loc[:, ('Guido', 'Temp')]

year  visit
2013  1        37.7
      2        38.8
2014  1        38.1
      2        36.7
Name: (Guido, Temp), dtype: float64

In [70]:
health_data.loc[(:, 1), (:, 'HR')]

SyntaxError: invalid syntax (3311942670.py, line 1)

In [73]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      24.0  41.0  45.0
2014 1      40.0  28.0  37.0

In [76]:
#health_data.loc[idx[2013, :], idx[:]]
health_data.loc[idx[2013, :]]

subject   Bob       Guido         Sue
type       HR  Temp    HR  Temp    HR  Temp
visit
1        24.0  36.9  41.0  37.7  45.0  36.8
2        39.0  35.8  35.0  38.8  38.0  36.2

In [69]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.063274
      2      0.593001
c     1      0.661605
      2      0.796971
b     1      0.962888
      2      0.432953
dtype: float64

In [79]:
# Index 정렬
data.sort_index()

char  int
a     1      0.063274
      2      0.593001
b     1      0.962888
      2      0.432953
c     1      0.661605
      2      0.796971
dtype: float64

In [80]:
data['a':'b']

char  int
a     1      0.063274
      2      0.593001
b     1      0.962888
      2      0.432953
dtype: float64

In [81]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [82]:
pop.unstack()

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [83]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [84]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [85]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [86]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [87]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [89]:
print(type(pop_flat))

<class 'pandas.core.frame.DataFrame'>

In [88]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [91]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      24.0  36.9  41.0  37.7  45.0  36.8
     2      39.0  35.8  35.0  38.8  38.0  36.2
2014 1      40.0  37.2  28.0  38.1  37.0  37.6
     2      40.0  35.4  44.0  36.7  48.0  38.0

In [99]:
# data_mean = health_data.mean(level='year') # deprecated
data_mean = health_data.groupby(level='year').median()
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR  Temp
year
2013     31.5  36.35  38.0  38.25  41.5  36.5
2014     40.0  36.30  36.0  37.40  42.5  37.8

In [102]:
# data_mean.mean(axis=1, level='type') # deprecated
health_data.groupby(axis=1, level='type').median()

type          HR  Temp
year visit
2013 1      41.0  36.9
     2      38.0  36.2
2014 1      37.0  37.6
     2      44.0  36.7

In [103]:
data_mean.groupby(axis=1, level='type').median()

type    HR  Temp
year
2013  38.0  36.5
2014  40.0  37.4

In [104]:
# numpy 배열 연결
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]
np.concatenate([x, y, z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [105]:
x = [[1, 2],
     [3, 4]]
np.concatenate([x, x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [110]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [111]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[1, 2, 3])
ser3 = pd.concat([ser1, ser2])
ser3

1    A
2    B
3    C
1    D
2    E
3    F
dtype: object

In [112]:
ser3[1]

1    A
1    D
dtype: object

In [115]:
ser4 = pd.concat([ser1, ser2], ignore_index=True)
ser4

0    A
1    B
2    C
3    D
4    E
5    F
dtype: object

In [113]:
df1 = pd.read_csv("https://raw.githubusercontent.com/t8t/python22/main/data/concat_1.csv")
df2 = pd.read_csv("https://raw.githubusercontent.com/t8t/python22/main/data/concat_2.csv")
df3 = pd.read_csv("https://raw.githubusercontent.com/t8t/python22/main/data/concat_3.csv")

df1, df2, df3

(    A   B   C   D
 0  a0  b0  c0  d0
 1  a1  b1  c1  d1
 2  a2  b2  c2  d2
 3  a3  b3  c3  d3,
     A   B   C   D
 0  a4  b4  c4  d4
 1  a5  b5  c5  d5
 2  a6  b6  c6  d6
 3  a7  b7  c7  d7,
      A    B    C    D
 0   a8   b8   c8   d8
 1   a9   b9   c9   d9
 2  a10  b10  c10  d10
 3  a11  b11  c11  d11)

In [117]:
# x축 기준 : 행으로 연결
row_concat = pd.concat([df1, df2, df3])
row_concat

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [119]:
#
col_concat = pd.concat([df1, df2, df3], axis=1)
col_concat

    A   B   C   D   A   B   C   D    A    B    C    D
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

In [120]:
row_concat.loc[0]

    A   B   C   D
0  a0  b0  c0  d0
0  a4  b4  c4  d4
0  a8  b8  c8  d8

In [124]:
row_concat.iloc[0]

A    a0
B    b0
C    c0
D    d0
Name: 0, dtype: object

In [126]:
row_concat.loc[1, 'A']

1    a1
1    a5
1    a9
Name: A, dtype: object

In [127]:
row_concat.iloc[5, 0]

'a5'

In [132]:
# 암시적인덱스 5행을 가지고 오시오
row_concat.iloc[5,]
row_concat.iloc[5]
row_concat.iloc[5, :]

A    a5
B    b5
C    c5
D    d5
Name: 1, dtype: object

In [134]:
new_row_series = pd.Series(['n1', 'n2', 'n3', 'n4'])
new_row_series

0    n1
1    n2
2    n3
3    n4
dtype: object

In [136]:
new_row_series, df1

(0    n1
 1    n2
 2    n3
 3    n4
 dtype: object,
     A   B   C   D
 0  a0  b0  c0  d0
 1  a1  b1  c1  d1
 2  a2  b2  c2  d2
 3  a3  b3  c3  d3)

In [137]:
# DataFrame 과 Series 연결
dataframe_series = pd.concat([new_row_series, df1])
dataframe_series

     0    A    B    C    D
0   n1  NaN  NaN  NaN  NaN
1   n2  NaN  NaN  NaN  NaN
2   n3  NaN  NaN  NaN  NaN
3   n4  NaN  NaN  NaN  NaN
0  NaN   a0   b0   c0   d0
1  NaN   a1   b1   c1   d1
2  NaN   a2   b2   c2   d2
3  NaN   a3   b3   c3   d3

In [138]:
dataframe_series = pd.concat([new_row_series, df1], axis=1)
dataframe_series

    0   A   B   C   D
0  n1  a0  b0  c0  d0
1  n2  a1  b1  c1  d1
2  n3  a2  b2  c2  d2
3  n4  a3  b3  c3  d3

In [139]:
df4 = pd.DataFrame([['n1','n2','n3','n4']], columns=['A','B','C','D'])
df4

    A   B   C   D
0  n1  n2  n3  n4

In [140]:
pd.concat([df4, df1])

    A   B   C   D
0  n1  n2  n3  n4
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [148]:
df5 = pd.concat([df1, df2, df3])
df5.loc[0]
df5.iloc[0]

    A   B   C   D
1  a1  b1  c1  d1
1  a5  b5  c5  d5
1  a9  b9  c9  d9

In [150]:
df5 = pd.concat([df1, df2, df3], ignore_index=True)
df5
df5.loc[0]

A    a0
B    b0
C    c0
D    d0
Name: 0, dtype: object

In [151]:
col_concat = pd.concat([df1, df2, df3], axis=1)
col_concat

    A   B   C   D   A   B   C   D    A    B    C    D
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

In [154]:
col_concat = pd.concat([df1, df2, df3], axis=1, ignore_index=True)
col_concat

   0   1   2   3   4   5   6   7    8    9    10   11
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

In [155]:
col_concat[0]

0    a0
1    a1
2    a2
3    a3
Name: 0, dtype: object

In [156]:
print(df1.columns)
print(df2.columns)
print(df3.columns)

Index(['A', 'B', 'C', 'D'], dtype='object')
Index(['A', 'B', 'C', 'D'], dtype='object')
Index(['A', 'B', 'C', 'D'], dtype='object')

In [158]:
df2.columns = ['E', 'F', 'G', 'H']
df2

    E   F   G   H
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [161]:
#df3.columns = ['I', 'J', 'K', 'L']
df3.columns = ['A', 'C', 'F', 'H']
df3

     A    C    F    H
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [162]:
df1, df2, df3

(    A   B   C   D
 0  a0  b0  c0  d0
 1  a1  b1  c1  d1
 2  a2  b2  c2  d2
 3  a3  b3  c3  d3,
     E   F   G   H
 0  a4  b4  c4  d4
 1  a5  b5  c5  d5
 2  a6  b6  c6  d6
 3  a7  b7  c7  d7,
      A    C    F    H
 0   a8   b8   c8   d8
 1   a9   b9   c9   d9
 2  a10  b10  c10  d10
 3  a11  b11  c11  d11)

In [163]:
df6 = pd.concat([df1, df3], join="inner")
df6

     A    C
0   a0   c0
1   a1   c1
2   a2   c2
3   a3   c3
0   a8   b8
1   a9   b9
2  a10  b10
3  a11  b11

In [164]:
df6 = pd.concat([df1, df3], join="inner", ignore_index=True)
df6

     A    C
0   a0   c0
1   a1   c1
2   a2   c2
3   a3   c3
4   a8   b8
5   a9   b9
6  a10  b10
7  a11  b11